# Multi-table Datasets - ENRON Archive

## 1. Data import

Connect to the file 'assets/datasets/enron.db' using one of these methods:

- sqlite3 python package
- pandas.read_sql
- SQLite Manager Firefox extension

Take a look at the database and query the master table. How many Tables are there in the db?

> Answer:
There are 3 tables:
- MessageBase
- RecipientBase
- EmployeeBase

In [1]:
import pandas as pd
from pandas.io import sql

import sqlite3
sqlite_db = '/Users/michael/DSI-projects/week05/1.3-lab-sqlite-enron/assets/datasets/enron.db'
conn = sqlite3.connect(sqlite_db)

import pandas as pd

In [2]:
c = conn.cursor()
c.execute('SELECT * from MessageBase')

conn.commit()

In [3]:
MessageBase = sql.read_sql('select * from MessageBase', con=conn)

In [5]:
RecipientBase = sql.read_sql('select * from RecipientBase', con=conn)

In [6]:
EmployeeBase = sql.read_sql('select * from EmployeeBase', con=conn)

In [7]:
MessageBase.head()

   mid          filename  unix_time                    subject  from_eid
0    1  taylor-m/sent/11  910930020             Cd$ CME letter       138
1    2  taylor-m/sent/17  911459940            Indemnification       138
2    3  taylor-m/sent/18  911463840        Re: Indemnification       138
3    4  taylor-m/sent/23  911874180     Re: Coral Energy, L.P.       138
4    5  taylor-m/sent/27  912396120  Bankruptcy Code revisions       138

In [8]:
RecipientBase.head()

   mid  rno  to_eid
0    1    1      59
1    2    1      15
2    3    1      15
3    4    1     109
4    4    2      49

In [9]:
EmployeeBase.head()

,eid,name,department,longdepartment,title,gender,seniority
0,1,John Arnold,Forestry,ENA Gas Financial,VP Trading,Male,Senior
1,2,Harry Arora,Forestry,ENA East Power,VP Trading,Male,Senior
2,3,Robert Badeer,Forestry,ENA West Power,Mgr Trading,Male,Junior
3,4,Susan Bailey,Legal,ENA Legal,Specialist Legal,Female,Junior
4,5,Eric Bass,Forestry,ENA Gas Texas,Trader,Male,Junior

Query the `sqlite_master` table to retrieve the schema of the `EmployeeBase` table.

1. What fields are there?
1. What's the type of each of them?

1. Print the first 5 rows of EmployeeBase table
1. Print the first 5 rows of MessageBase table
1. Print the first 5 rows of RecipientBase table

**Hint**  use `SELECT` and `LIMIT`.

In [10]:
sql.read_sql('select * from MessageBase limit 5', con=conn)

   mid          filename  unix_time                    subject  from_eid
0    1  taylor-m/sent/11  910930020             Cd$ CME letter       138
1    2  taylor-m/sent/17  911459940            Indemnification       138
2    3  taylor-m/sent/18  911463840        Re: Indemnification       138
3    4  taylor-m/sent/23  911874180     Re: Coral Energy, L.P.       138
4    5  taylor-m/sent/27  912396120  Bankruptcy Code revisions       138

In [11]:
sql.read_sql('select * from RecipientBase limit 5', con=conn)

   mid  rno  to_eid
0    1    1      59
1    2    1      15
2    3    1      15
3    4    1     109
4    4    2      49

In [12]:
sql.read_sql('select * from EmployeeBase limit 5', con=conn)

,eid,name,department,longdepartment,title,gender,seniority
0,1,John Arnold,Forestry,ENA Gas Financial,VP Trading,Male,Senior
1,2,Harry Arora,Forestry,ENA East Power,VP Trading,Male,Senior
2,3,Robert Badeer,Forestry,ENA West Power,Mgr Trading,Male,Junior
3,4,Susan Bailey,Legal,ENA Legal,Specialist Legal,Female,Junior
4,5,Eric Bass,Forestry,ENA Gas Texas,Trader,Male,Junior

Import each of the 3 tables to a Pandas Dataframes

## 2. Data Exploration

Use the 3 dataframes to answer the following questions:

1. How many employees are there in the company?
- How many messages are there in the database?
- Convert the timestamp column in the messages. When was the oldest message sent? And the newest?
- Some messages are sent to more than one recipient. Group the messages by message_id and count the number of recepients. Then look at the distribution of recepient numbers.
    - How many messages have only one recepient?
    - How many messages have >= 5 recepients?
    - What's the highest number of recepients?
    - Who sent the message with the highest number of recepients?
- Plot the distribution of recepient numbers using Bokeh.

In [13]:
sql.read_sql('select count(name) from EmployeeBase', con=conn)

   count(name)
0          156

In [14]:
import datetime
def convertUTime(): 
    return datetime.datetime.fromtimestamp(int("1284101485")).strftime('%Y-%m-%d %H:%M:%S')

In [18]:
MessageBase['unix_time'] = pd.to_datetime(MessageBase['unix_time'], unit = 's')

In [19]:
c.execute('SELECT * from MessageBase')

conn.commit()

In [20]:
sql.read_sql('select min(unix_time) from Messagebase', con=conn)

   min(unix_time)
0       910930020

In [21]:
RecipientBase.head(10)

   mid  rno  to_eid
0    1    1      59
1    2    1      15
2    3    1      15
3    4    1     109
4    4    2      49
5    4    3     120
6    4    4      59
7    5    1      45
8    5    2      53
9    6    1     113

In [76]:
x = sql.read_sql('SELECT mid, MAX(rno) as maxRNO FROM RecipientBase group by mid', con=conn)
y = x['maxRNO'].value_counts()

In [79]:
z = pd.DataFrame(y).sort()

/Users/michael/anaconda/lib/python2.7/site-packages/ipykernel/__main__.py:1: FutureWarning: sort(....) is deprecated, use sort_index(.....)
  if __name__ == '__main__':

In [80]:
z

    maxRNO
1    14985
2     2962
3     1435
4      873
5      711
6      180
7      176
8       61
9       24
10      29
11      47
12      33
13      57
14      11
15      28
16       9
17       2
18       1
19       1
20       1
21       2
22       1
24       1
49       1
52       1
55       1
57       2

In [75]:
z

    maxRNO
11      47
12      33
10      29
15      28
9       24
14      11
16       9
21       2
17       2
57       2
22       1
52       1
20       1
55       1
19       1
24       1
18       1
49       1

In [47]:
newList = []
for element in range(len(y)):
    if element >=5:
        newList.append(element)
sum(newList)

341

Rescale to investigate the tail of the curve

## 3. Data Merging

Use the pandas merge function to combine the information in the 3 dataframes to answer the following questions:

1. Are there more Men or Women employees?
- How is gender distributed across departments?
- Who is sending more emails? Men or Women?
- What's the average number of emails sent by each gender?
- Are there more Juniors or Seniors?
- Who is sending more emails? Juniors or Seniors?
- Which department is sending more emails? How does that relate with the number of employees in the department?
- Who are the top 3 senders of emails? (people who sent out the most emails)

Answer the following questions regarding received messages:

- Who is receiving more emails? Men or Women?
- Who is receiving more emails? Juniors or Seniors?
- Which department is receiving more emails? How does that relate with the number of employees in the department?
- Who are the top 5 receivers of emails? (people who received the most emails)

Which employees sent the most 'mass' emails?

Keep exploring the dataset, which other questions would you ask?

Work in pairs. Give each other a challenge and try to solve it.